# Denormalizando el esquema en MySQL

In [98]:
%load_ext sql
%sql mysql://root:root@columnar-mysql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [99]:
%sql SHOW DATABASES;

 * mysql://root:***@columnar-mysql
5 rows affected.

[('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',)]

In [100]:
%sql CREATE DATABASE sakila_dimensional;

 * mysql://root:***@columnar-mysql
1 rows affected.

[]

In [101]:
%sql USE sakila_dimensional;

 * mysql://root:***@columnar-mysql
0 rows affected.

[]

In [102]:
%%sql CREATE TABLE film_dimension (
	film_id SMALLINT UNSIGNED PRIMARY KEY,
	title VARCHAR(255),
	description TEXT,
	release_year YEAR,
	length SMALLINT UNSIGNED,
	rating ENUM('G', 'PG', 'PG-13','R','NC-17'),
	language CHAR(20),
	category VARCHAR(25)
);

 * mysql://root:***@columnar-mysql
0 rows affected.

[]

In [103]:
%%sql 
INSERT INTO film_dimension
SELECT f.film_id, f.title, f.description, f.release_year, f.`length`, f.rating, l1.name AS 'language', c.name  AS category 
FROM 
	sakila.film f
	INNER JOIN sakila.`language` l1 ON f.language_id = l1.language_id
	INNER JOIN sakila.film_category fc ON fc.film_id = f.film_id 
	INNER JOIN sakila.category c ON c.category_id  = fc.category_id;

 * mysql://root:***@columnar-mysql
1000 rows affected.

[]

In [104]:
%%sql
CREATE TABLE customer_dimension (
	customer_id SMALLINT UNSIGNED PRIMARY KEY,
	customer VARCHAR(90),
	city VARCHAR(50),
	country VARCHAR(50)
);

 * mysql://root:***@columnar-mysql
0 rows affected.

[]

In [105]:
%%sql
INSERT INTO customer_dimension
SELECT c3.customer_id, CONCAT(c3.first_name, ' ', c3.last_name) AS customer, c.city, c2.country  
FROM 
	sakila.address a 
	INNER JOIN sakila.city c ON a.city_id = c.city_id 
	INNER JOIN sakila.country c2 ON c.country_id = c2.country_id 
	INNER JOIN sakila.customer c3 ON c3.address_id = a.address_id;

 * mysql://root:***@columnar-mysql
599 rows affected.

[]

In [106]:
%%sql
CREATE TABLE store_dimension(
	store_id SMALLINT UNSIGNED PRIMARY KEY,
	manager VARCHAR(90),
	address VARCHAR(50),
	district VARCHAR(20),
	city VARCHAR(50),
	country VARCHAR(50)
);

 * mysql://root:***@columnar-mysql
0 rows affected.

[]

In [107]:
%%sql
INSERT INTO store_dimension
SELECT s.store_id, CONCAT(s2.first_name, ' ', s2.last_name) AS manager, a.address, a.district, c.city, c2.country 
FROM 
	sakila.address a 
	INNER JOIN sakila.city c ON a.city_id = c.city_id 
	INNER JOIN sakila.country c2 ON c.country_id = c2.country_id 
	INNER JOIN sakila.store s ON s.address_id = a.address_id 
	INNER JOIN sakila.staff s2 ON s.manager_staff_id = s2.staff_id

 * mysql://root:***@columnar-mysql
2 rows affected.

[]

In [108]:
%%sql
CREATE TABLE datetime_dimension (
	datetime_id SMALLINT UNSIGNED PRIMARY KEY AUTO_INCREMENT,
	datetime DATETIME,
	date DATE,
	time TIME,
	year YEAR,
	month TINYINT,
	day TINYINT,
	dow CHAR(15)
)

 * mysql://root:***@columnar-mysql
0 rows affected.

[]

In [109]:
%%sql
INSERT INTO datetime_dimension
SELECT 
	ROW_NUMBER() OVER (PARTITION BY p.part) AS datetime_id,
	p.payment_date AS datetime,
	DATE(p.payment_date) AS date, 
	TIME(p.payment_date) AS time,
	YEAR(p.payment_date) AS year,
	MONTH(p.payment_date) AS month,
	DAY(p.payment_date) AS day,
	DAYOFWEEK(p.payment_date) AS dow 
FROM (
		SELECT p1.payment_date, 1 AS part
			FROM sakila.payment p1
			GROUP BY p1.payment_date
	) AS p

 * mysql://root:***@columnar-mysql
15819 rows affected.

[]

In [110]:
%%sql
CREATE TABLE payment_fact (
	payment_id SMALLINT UNSIGNED PRIMARY KEY,
	customer_id SMALLINT UNSIGNED,
	film_id SMALLINT UNSIGNED,
	store_id SMALLINT UNSIGNED,
	datetime_id SMALLINT UNSIGNED,
	amount DECIMAL(5,2),
	CONSTRAINT customer_fk FOREIGN KEY (customer_id) REFERENCES customer_dimension (customer_id),
	CONSTRAINT film_fk FOREIGN KEY (film_id) REFERENCES film_dimension (film_id),
	CONSTRAINT store_fk FOREIGN KEY (store_id) REFERENCES store_dimension (store_id),
	CONSTRAINT datetime_fk FOREIGN KEY (datetime_id) REFERENCES datetime_dimension (datetime_id)
)

 * mysql://root:***@columnar-mysql
0 rows affected.

[]

In [111]:
%%sql
INSERT INTO payment_fact
SELECT p.payment_id, p.customer_id, f.film_id, s.store_id, d.datetime_id, p.amount
FROM
	sakila.payment p 
	INNER JOIN sakila.rental r ON p.rental_id = r.rental_id 
	INNER JOIN sakila.inventory i ON r.inventory_id = i.inventory_id 
	INNER JOIN sakila.film f ON f.film_id = i.film_id 
	INNER JOIN sakila.staff s ON p.staff_id = s.staff_id 
	iNNER JOIN sakila.store s2 ON s2.store_id = s.store_id 
	INNER JOIN sakila_dimensional.datetime_dimension d  ON p.payment_date = d.`datetime`

 * mysql://root:***@columnar-mysql
16044 rows affected.

[]

In [272]:
%%time
%%sql
SELECT year, month, category, SUM(amount)
FROM 
    payment_fact pf
    INNER JOIN datetime_dimension dd ON pf.datetime_id = dd.datetime_id
    INNER JOIN film_dimension fd ON pf.film_id = fd.film_id
GROUP BY
    year, month, category

 * mysql://root:***@columnar-mysql
80 rows affected.
CPU times: user 9.15 ms, sys: 1.02 ms, total: 10.2 ms
Wall time: 40 ms

[(2005, 7, 'Documentary', Decimal('1726.71')),
 (2005, 8, 'Documentary', Decimal('1517.31')),
 (2005, 6, 'Documentary', Decimal('612.40')),
 (2005, 5, 'Documentary', Decimal('353.14')),
 (2005, 7, 'Horror', Decimal('1594.34')),
 (2005, 8, 'Horror', Decimal('1342.01')),
 (2006, 2, 'Horror', Decimal('33.88')),
 (2005, 6, 'Horror', Decimal('508.84')),
 (2005, 5, 'Horror', Decimal('243.47')),
 (2005, 7, 'Family', Decimal('1840.40')),
 (2005, 5, 'Family', Decimal('304.15')),
 (2005, 8, 'Family', Decimal('1474.16')),
 (2005, 6, 'Family', Decimal('577.46')),
 (2006, 2, 'Family', Decimal('29.90')),
 (2005, 7, 'Foreign', Decimal('1764.68')),
 (2005, 8, 'Foreign', Decimal('1599.23')),
 (2005, 6, 'Foreign', Decimal('585.58')),
 (2005, 5, 'Foreign', Decimal('296.29')),
 (2005, 8, 'Comedy', Decimal('1593.58')),
 (2005, 7, 'Comedy', Decimal('1829.17')),
 (2005, 6, 'Comedy', Decimal('639.65')),
 (2005, 7, 'Sports', Decimal('2281.03')),
 (2005, 6, 'Sports', Decimal('696.41')),
 (2005, 8, 'Sports', Decimal('1962.68')),
 (2005, 8, 'Music', Decimal('1163.23')),
 (2005, 7, 'Music', Decimal('1434.52')),
 (2005, 5, 'Music', Decimal('268.39')),
 (2005, 6, 'Music', Decimal('526.67')),
 (2006, 2, 'Music', Decimal('24.91')),
 (2005, 7, 'Animation', Decimal('1954.11')),
 (2005, 8, 'Animation', Decimal('1654.92')),
 (2005, 5, 'Animation', Decimal('289.26')),
 (2005, 6, 'Animation', Decimal('691.26')),
 (2005, 6, 'Action', Decimal('681.40')),
 (2005, 8, 'Action', Decimal('1463.16')),
 (2005, 7, 'Action', Decimal('1804.36')),
 (2005, 5, 'Action', Decimal('371.13')),
 (2006, 2, 'Action', Decimal('55.80')),
 (2005, 7, 'New', Decimal('1826.11')),
 (2005, 8, 'New', Decimal('1626.54')),
 (2005, 6, 'New', Decimal('565.68')),
 (2006, 2, 'New', Decimal('30.89')),
 (2005, 5, 'New', Decimal('302.40')),
 (2005, 8, 'Sci-Fi', Decimal('1707.15')),
 (2005, 5, 'Sci-Fi', Decimal('320.16')),
 (2005, 6, 'Sci-Fi', Decimal('685.38')),
 (2005, 7, 'Sci-Fi', Decimal('2013.38')),
 (2005, 5, 'Comedy', Decimal('295.28')),
 (2005, 8, 'Classics', Decimal('1371.52')),
 (2005, 7, 'Classics', Decimal('1497.16')),
 (2005, 6, 'Classics', Decimal('518.64')),
 (2006, 2, 'Sci-Fi', Decimal('30.91')),
 (2005, 5, 'Sports', Decimal('333.24')),
 (2005, 7, 'Games', Decimal('1811.08')),
 (2005, 6, 'Games', Decimal('628.58')),
 (2005, 8, 'Games', Decimal('1508.48')),
 (2005, 5, 'Games', Decimal('293.31')),
 (2005, 7, 'Children', Decimal('1539.94')),
 (2005, 6, 'Children', Decimal('495.70')),
 (2005, 8, 'Children', Decimal('1315.68')),
 (2005, 5, 'Children', Decimal('288.29')),
 (2005, 7, 'Travel', Decimal('1473.55')),
 (2005, 6, 'Travel', Decimal('533.76')),
 (2005, 8, 'Travel', Decimal('1244.02')),
 (2005, 5, 'Travel', Decimal('267.40')),
 (2006, 2, 'Travel', Decimal('30.91')),
 (2005, 5, 'Classics', Decimal('227.38')),
 (2005, 7, 'Drama', Decimal('1978.37')),
 (2005, 8, 'Drama', Decimal('1526.47')),
 (2005, 6, 'Drama', Decimal('682.48')),
 (2005, 5, 'Drama', Decimal('370.15')),
 (2006, 2, 'Drama', Decimal('29.92')),
 (2006, 2, 'Classics', Decimal('24.89')),
 (2006, 2, 'Sports', Decimal('40.85')),
 (2006, 2, 'Animation', Decimal('66.75')),
 (2006, 2, 'Comedy', Decimal('25.90')),
 (2006, 2, 'Games', Decimal('39.88')),
 (2006, 2, 'Children', Decimal('15.94')),
 (2006, 2, 'Foreign', Decimal('24.89')),
 (2006, 2, 'Documentary', Decimal('7.96'))]

# Utilizando MonetDB con pymonetdb

In [224]:
import pymonetdb

In [225]:
connection = pymonetdb.connect(username="monetdb", password="monetdb", hostname="columnar-monetdb", port=50000, database="sakila-db")

In [226]:
cursor = connection.cursor()

In [227]:
q = """
CREATE TABLE film_dimension (
    film_id INT PRIMARY KEY,
    title VARCHAR(255),
    description TEXT,
    release_year INT,
    length INT,
    rating VARCHAR(10),
    language CHAR(20),
    category VARCHAR(25)
);

CREATE TABLE customer_dimension (
	customer_id INT PRIMARY KEY,
	customer VARCHAR(90),
	city VARCHAR(50),
	country VARCHAR(50)
);

CREATE TABLE store_dimension(
	store_id INT PRIMARY KEY,
	manager VARCHAR(90),
	address VARCHAR(50),
	district VARCHAR(20),
	city VARCHAR(50),
	country VARCHAR(50)
);


CREATE TABLE datetime_dimension (
	datetime_id INT PRIMARY KEY,
	datetime TIMESTAMP,
	date DATE,
	time TIME,
	"year" INT,
	"month" INT,
	"day" INT,
	dow CHAR(15)
);


CREATE TABLE payment_fact (
	payment_id INT PRIMARY KEY,
	customer_id INT,
	film_id INT,
	store_id INT,
	datetime_id INT,
	amount DECIMAL(5,2),
	CONSTRAINT customer_fk FOREIGN KEY (customer_id) REFERENCES customer_dimension (customer_id),
	CONSTRAINT film_fk FOREIGN KEY (film_id) REFERENCES film_dimension (film_id),
	CONSTRAINT store_fk FOREIGN KEY (store_id) REFERENCES store_dimension (store_id),
	CONSTRAINT datetime_fk FOREIGN KEY (datetime_id) REFERENCES datetime_dimension (datetime_id)
);
"""

In [228]:
cursor.execute(q)

In [229]:
connection.commit()

In [250]:
q = """COPY OFFSET 2 INTO film_dimension
FROM '/dimensional/film_dimension.csv'
USING DELIMITERS ',', E'\n', '"'
NULL AS '';
""";
cursor.execute(q)

In [248]:
q = """COPY OFFSET 2 INTO customer_dimension
FROM '/dimensional/customer_dimension.csv'
USING DELIMITERS ',', E'\n', '"'
NULL AS '';
""";
cursor.execute(q)

In [252]:
q = """COPY OFFSET 2 INTO store_dimension
FROM '/dimensional/store_dimension.csv'
USING DELIMITERS ',', E'\n', '"'
NULL AS '';
""";
cursor.execute(q)

In [ ]:
q = """COPY OFFSET 2 INTO datetime_dimension
FROM '/dimensional/datetime_dimension.csv'
USING DELIMITERS ',', E'\n', '"'
NULL AS '';
""";
cursor.execute(q)

In [256]:
q = """COPY OFFSET 2 INTO payment_fact
FROM '/dimensional/payment_fact.csv'
USING DELIMITERS ',', E'\n', '"'
NULL AS '';
""";
cursor.execute(q)

In [ ]:
connection.commit()

In [261]:
connection.rollback()

In [262]:
q = """
SELECT "year", "month", category, SUM(amount)
FROM 
    payment_fact pf
    INNER JOIN datetime_dimension dd ON pf.datetime_id = dd.datetime_id
    INNER JOIN film_dimension fd ON pf.film_id = fd.film_id
GROUP BY
    "year", "month", category
"""

80

In [271]:
%%time
cursor.execute(q)
cursor.fetchall()

CPU times: user 2.16 ms, sys: 1.07 ms, total: 3.22 ms
Wall time: 6.03 ms

[(2005, 5, 'Classics', Decimal('227.38')),
 (2005, 5, 'Sports', Decimal('333.24')),
 (2005, 6, 'Classics', Decimal('518.64')),
 (2005, 6, 'Comedy', Decimal('639.65')),
 (2005, 6, 'Sci-Fi', Decimal('685.38')),
 (2005, 6, 'Drama', Decimal('682.48')),
 (2005, 6, 'Music', Decimal('526.67')),
 (2005, 7, 'Games', Decimal('1811.08')),
 (2005, 7, 'Sports', Decimal('2281.03')),
 (2005, 7, 'Comedy', Decimal('1829.17')),
 (2005, 7, 'Music', Decimal('1434.52')),
 (2005, 7, 'Travel', Decimal('1473.55')),
 (2005, 7, 'Drama', Decimal('1978.37')),
 (2005, 7, 'Animation', Decimal('1954.11')),
 (2005, 7, 'Foreign', Decimal('1764.68')),
 (2005, 7, 'Classics', Decimal('1497.16')),
 (2005, 7, 'Action', Decimal('1804.36')),
 (2005, 7, 'New', Decimal('1826.11')),
 (2005, 8, 'Documentary', Decimal('1517.31')),
 (2005, 8, 'Drama', Decimal('1526.47')),
 (2005, 8, 'Family', Decimal('1474.16')),
 (2005, 8, 'Action', Decimal('1463.16')),
 (2005, 8, 'Classics', Decimal('1371.52')),
 (2005, 8, 'New', Decimal('1626.54')),
 (2005, 8, 'Sci-Fi', Decimal('1707.15')),
 (2005, 8, 'Comedy', Decimal('1593.58')),
 (2005, 8, 'Animation', Decimal('1654.92')),
 (2005, 5, 'Animation', Decimal('289.26')),
 (2005, 6, 'Animation', Decimal('691.26')),
 (2005, 8, 'Sports', Decimal('1962.68')),
 (2005, 8, 'Games', Decimal('1508.48')),
 (2005, 8, 'Children', Decimal('1315.68')),
 (2005, 5, 'Action', Decimal('371.13')),
 (2005, 5, 'New', Decimal('302.40')),
 (2005, 6, 'Horror', Decimal('508.84')),
 (2005, 6, 'Documentary', Decimal('612.40')),
 (2005, 7, 'Family', Decimal('1840.40')),
 (2005, 7, 'Horror', Decimal('1594.34')),
 (2005, 8, 'Music', Decimal('1163.23')),
 (2005, 6, 'Family', Decimal('577.46')),
 (2005, 6, 'Sports', Decimal('696.41')),
 (2005, 6, 'Action', Decimal('681.40')),
 (2005, 6, 'Children', Decimal('495.70')),
 (2005, 6, 'New', Decimal('565.68')),
 (2005, 8, 'Foreign', Decimal('1599.23')),
 (2005, 8, 'Travel', Decimal('1244.02')),
 (2005, 8, 'Horror', Decimal('1342.01')),
 (2005, 5, 'Children', Decimal('288.29')),
 (2005, 5, 'Horror', Decimal('243.47')),
 (2005, 6, 'Games', Decimal('628.58')),
 (2006, 2, 'Family', Decimal('29.90')),
 (2005, 5, 'Comedy', Decimal('295.28')),
 (2005, 5, 'Family', Decimal('304.15')),
 (2005, 5, 'Sci-Fi', Decimal('320.16')),
 (2005, 6, 'Foreign', Decimal('585.58')),
 (2005, 7, 'Children', Decimal('1539.94')),
 (2005, 7, 'Sci-Fi', Decimal('2013.38')),
 (2005, 5, 'Travel', Decimal('267.40')),
 (2005, 5, 'Drama', Decimal('370.15')),
 (2005, 5, 'Foreign', Decimal('296.29')),
 (2005, 6, 'Travel', Decimal('533.76')),
 (2005, 7, 'Documentary', Decimal('1726.71')),
 (2006, 2, 'Documentary', Decimal('7.96')),
 (2005, 5, 'Music', Decimal('268.39')),
 (2006, 2, 'Action', Decimal('55.80')),
 (2005, 5, 'Games', Decimal('293.31')),
 (2006, 2, 'Comedy', Decimal('25.90')),
 (2006, 2, 'Classics', Decimal('24.89')),
 (2005, 5, 'Documentary', Decimal('353.14')),
 (2006, 2, 'Games', Decimal('39.88')),
 (2006, 2, 'Animation', Decimal('66.75')),
 (2006, 2, 'New', Decimal('30.89')),
 (2006, 2, 'Foreign', Decimal('24.89')),
 (2006, 2, 'Drama', Decimal('29.92')),
 (2006, 2, 'Sports', Decimal('40.85')),
 (2006, 2, 'Horror', Decimal('33.88')),
 (2006, 2, 'Travel', Decimal('30.91')),
 (2006, 2, 'Music', Decimal('24.91')),
 (2006, 2, 'Sci-Fi', Decimal('30.91')),
 (2006, 2, 'Children', Decimal('15.94'))]